# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 3   # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

anchors:
#tt100k
- [5,5, 6,7, 8,9]
- [10,11, 9,17, 13,14]
- [16,17, 21,22, 16,31]
- [28,29, 36,39, 61,56]

#ctsdb21
# - [5,6, 9,9, 12,12]
# - [15,15, 19,19, 13,31]
# - [24,24, 33,31, 22,57]
# - [46,45, 61,79, 113,119]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]], 
   [-1, 1, Conv, [128, 3, 2]], 
   [-1, 3, C3CA, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 6, C3CA, [256]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 9, C3CA, [512]],
   [-1, 1, Conv, [1024, 3, 2]], 
   [-1, 3, C3CA, [1024]],
   [-1, 1, SPPF, [1024, 5]],
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]], 
   [-1, 1, CNeB, [512, False]], 

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]], 
   [-1, 1, CNeB, [256, False]],  

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]], 
   [-1, 1, CNeB, [128, False]], 

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 18], 1, Concat, [1]], 
   [-1, 1, CNeB, [256, False]], 

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]], 
   [-1, 1, CNeB, [512, False]], 

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]], 
   [-1, 1, CNeB, [1024, False]], 

   [[21, 24, 27, 30], 1, Detect, [nc, anchors]], 
  ]